hpmicro/hpm_sdk/soc/HPM5E00/ip/hpm_trgm_regs.h
/*
 * QEI0_ADC1_SEL (RW)
 *
 */
#define TRGM_ADC_MATRIX_SEL0_QEI0_ADC1_SEL_MASK (0xFF00U)
#define TRGM_ADC_MATRIX_SEL0_QEI0_ADC1_SEL_SHIFT (8U)
#define TRGM_ADC_MATRIX_SEL0_QEI0_ADC1_SEL_SET(x) (((uint32_t)(x) << TRGM_ADC_MATRIX_SEL0_QEI0_ADC1_SEL_SHIFT) & TRGM_ADC_MATRIX_SEL0_QEI0_ADC1_SEL_MASK)
#define TRGM_ADC_MATRIX_SEL0_QEI0_ADC1_SEL_GET(x) (((uint32_t)(x) & TRGM_ADC_MATRIX_SEL0_QEI0_ADC1_SEL_MASK) >> TRGM_ADC_MATRIX_SEL0_QEI0_ADC1_SEL_SHIFT)

/*
 * QEI0_ADC0_SEL (RW)
 *
 */
#define TRGM_ADC_MATRIX_SEL0_QEI0_ADC0_SEL_MASK (0xFFU)
#define TRGM_ADC_MATRIX_SEL0_QEI0_ADC0_SEL_SHIFT (0U)
#define TRGM_ADC_MATRIX_SEL0_QEI0_ADC0_SEL_SET(x) (((uint32_t)(x) << TRGM_ADC_MATRIX_SEL0_QEI0_ADC0_SEL_SHIFT) & TRGM_ADC_MATRIX_SEL0_QEI0_ADC0_SEL_MASK)
#define TRGM_ADC_MATRIX_SEL0_QEI0_ADC0_SEL_GET(x) (((uint32_t)(x) & TRGM_ADC_MATRIX_SEL0_QEI0_ADC0_SEL_MASK) >> TRGM_ADC_MATRIX_SEL0_QEI0_ADC0_SEL_SHIFT)

/* Bitfield definition for register: DAC_MATRIX_SEL0 */
/*
 * PWM0_DAC1_SEL (RW)
 *
 */
#define TRGM_DAC_MATRIX_SEL0_PWM0_DAC1_SEL_MASK (0xFF000000UL)
#define TRGM_DAC_MATRIX_SEL0_PWM0_DAC1_SEL_SHIFT (24U)
#define TRGM_DAC_MATRIX_SEL0_PWM0_DAC1_SEL_SET(x) (((uint32_t)(x) << TRGM_DAC_MATRIX_SEL0_PWM0_DAC1_SEL_SHIFT) & TRGM_DAC_MATRIX_SEL0_PWM0_DAC1_SEL_MASK)
#define TRGM_DAC_MATRIX_SEL0_PWM0_DAC1_SEL_GET(x) (((uint32_t)(x) & TRGM_DAC_MATRIX_SEL0_PWM0_DAC1_SEL_MASK) >> TRGM_DAC_MATRIX_SEL0_PWM0_DAC1_SEL_SHIFT)

/*
 * PWM0_DAC0_SEL (RW)
 *
 */
#define TRGM_DAC_MATRIX_SEL0_PWM0_DAC0_SEL_MASK (0xFF0000UL)
#define TRGM_DAC_MATRIX_SEL0_PWM0_DAC0_SEL_SHIFT (16U)
#define TRGM_DAC_MATRIX_SEL0_PWM0_DAC0_SEL_SET(x) (((uint32_t)(x) << TRGM_DAC_MATRIX_SEL0_PWM0_DAC0_SEL_SHIFT) & TRGM_DAC_MATRIX_SEL0_PWM0_DAC0_SEL_MASK)
#define TRGM_DAC_MATRIX_SEL0_PWM0_DAC0_SEL_GET(x) (((uint32_t)(x) & TRGM_DAC_MATRIX_SEL0_PWM0_DAC0_SEL_MASK) >> TRGM_DAC_MATRIX_SEL0_PWM0_DAC0_SEL_SHIFT)

/*
 * ACMP0_CH1_DAC_SEL (RW)
 *
 */
#define TRGM_DAC_MATRIX_SEL0_ACMP0_CH1_DAC_SEL_MASK (0xFF00U)
#define TRGM_DAC_MATRIX_SEL0_ACMP0_CH1_DAC_SEL_SHIFT (8U)
#define TRGM_DAC_MATRIX_SEL0_ACMP0_CH1_DAC_SEL_SET(x) (((uint32_t)(x) << TRGM_DAC_MATRIX_SEL0_ACMP0_CH1_DAC_SEL_SHIFT) & TRGM_DAC_MATRIX_SEL0_ACMP0_CH1_DAC_SEL_MASK)
#define TRGM_DAC_MATRIX_SEL0_ACMP0_CH1_DAC_SEL_GET(x) (((uint32_t)(x) & TRGM_DAC_MATRIX_SEL0_ACMP0_CH1_DAC_SEL_MASK) >> TRGM_DAC_MATRIX_SEL0_ACMP0_CH1_DAC_SEL_SHIFT)

/*
 * ACMP0_CH0_DAC_SEL (RW)
 *
 */
#define TRGM_DAC_MATRIX_SEL0_ACMP0_CH0_DAC_SEL_MASK (0xFFU)
#define TRGM_DAC_MATRIX_SEL0_ACMP0_CH0_DAC_SEL_SHIFT (0U)
#define TRGM_DAC_MATRIX_SEL0_ACMP0_CH0_DAC_SEL_SET(x) (((uint32_t)(x) << TRGM_DAC_MATRIX_SEL0_ACMP0_CH0_DAC_SEL_SHIFT) & TRGM_DAC_MATRIX_SEL0_ACMP0_CH0_DAC_SEL_MASK)
#define TRGM_DAC_MATRIX_SEL0_ACMP0_CH0_DAC_SEL_GET(x) (((uint32_t)(x) & TRGM_DAC_MATRIX_SEL0_ACMP0_CH0_DAC_SEL_MASK) >> TRGM_DAC_MATRIX_SEL0_ACMP0_CH0_DAC_SEL_SHIFT)

/* Bitfield definition for register: DAC_MATRIX_SEL1 */
/*
 * PWM1_DAC1_SEL (RW)
 *
 */
#define TRGM_DAC_MATRIX_SEL1_PWM1_DAC1_SEL_MASK (0xFF000000UL)
#define TRGM_DAC_MATRIX_SEL1_PWM1_DAC1_SEL_SHIFT (24U)
#define TRGM_DAC_MATRIX_SEL1_PWM1_DAC1_SEL_SET(x) (((uint32_t)(x) << TRGM_DAC_MATRIX_SEL1_PWM1_DAC1_SEL_SHIFT) & TRGM_DAC_MATRIX_SEL1_PWM1_DAC1_SEL_MASK)
#define TRGM_DAC_MATRIX_SEL1_PWM1_DAC1_SEL_GET(x) (((uint32_t)(x) & TRGM_DAC_MATRIX_SEL1_PWM1_DAC1_SEL_MASK) >> TRGM_DAC_MATRIX_SEL1_PWM1_DAC1_SEL_SHIFT)

/*
 * PWM1_DAC0_SEL (RW)
 *
 */
#define TRGM_DAC_MATRIX_SEL1_PWM1_DAC0_SEL_MASK (0xFF0000UL)
#define TRGM_DAC_MATRIX_SEL1_PWM1_DAC0_SEL_SHIFT (16U)
#define TRGM_DAC_MATRIX_SEL1_PWM1_DAC0_SEL_SET(x) (((uint32_t)(x) << TRGM_DAC_MATRIX_SEL1_PWM1_DAC0_SEL_SHIFT) & TRGM_DAC_MATRIX_SEL1_PWM1_DAC0_SEL_MASK)
#define TRGM_DAC_MATRIX_SEL1_PWM1_DAC0_SEL_GET(x) (((uint32_t)(x) & TRGM_DAC_MATRIX_SEL1_PWM1_DAC0_SEL_MASK) >> TRGM_DAC_MATRIX_SEL1_PWM1_DAC0_SEL_SHIFT)

/*
 * PWM0_DAC3_SEL (RW)
 *
 */
#define TRGM_DAC_MATRIX_SEL1_PWM0_DAC3_SEL_MASK (0xFF00U)
#define TRGM_DAC_MATRIX_SEL1_PWM0_DAC3_SEL_SHIFT (8U)
#define TRGM_DAC_MATRIX_SEL1_PWM0_DAC3_SEL_SET(x) (((uint32_t)(x) << TRGM_DAC_MATRIX_SEL1_PWM0_DAC3_SEL_SHIFT) & TRGM_DAC_MATRIX_SEL1_PWM0_DAC3_SEL_MASK)
#define TRGM_DAC_MATRIX_SEL1_PWM0_DAC3_SEL_GET(x) (((uint32_t)(x) & TRGM_DAC_MATRIX_SEL1_PWM0_DAC3_SEL_MASK) >> TRGM_DAC_MATRIX_SEL1_PWM0_DAC3_SEL_SHIFT)

/*
 * PWM0_DAC2_SEL (RW)
 *
 */
#define TRGM_DAC_MATRIX_SEL1_PWM0_DAC2_SEL_MASK (0xFFU)
#define TRGM_DAC_MATRIX_SEL1_PWM0_DAC2_SEL_SHIFT (0U)
#define TRGM_DAC_MATRIX_SEL1_PWM0_DAC2_SEL_SET(x) (((uint32_t)(x) << TRGM_DAC_MATRIX_SEL1_PWM0_DAC2_SEL_SHIFT) & TRGM_DAC_MATRIX_SEL1_PWM0_DAC2_SEL_MASK)
#define TRGM_DAC_MATRIX_SEL1_PWM0_DAC2_SEL_GET(x) (((uint32_t)(x) & TRGM_DAC_MATRIX_SEL1_PWM0_DAC2_SEL_MASK) >> TRGM_DAC_MATRIX_SEL1_PWM0_DAC2_SEL_SHIFT)

/* Bitfield definition for register: DAC_MATRIX_SEL2 */
/*
 * PWM1_DAC3_SEL (RW)
 *
 */
#define TRGM_DAC_MATRIX_SEL2_PWM1_DAC3_SEL_MASK (0xFF00U)
#define TRGM_DAC_MATRIX_SEL2_PWM1_DAC3_SEL_SHIFT (8U)
#define TRGM_DAC_MATRIX_SEL2_PWM1_DAC3_SEL_SET(x) (((uint32_t)(x) << TRGM_DAC_MATRIX_SEL2_PWM1_DAC3_SEL_SHIFT) & TRGM_DAC_MATRIX_SEL2_PWM1_DAC3_SEL_MASK)
#define TRGM_DAC_MATRIX_SEL2_PWM1_DAC3_SEL_GET(x) (((uint32_t)(x) & TRGM_DAC_MATRIX_SEL2_PWM1_DAC3_SEL_MASK) >> TRGM_DAC_MATRIX_SEL2_PWM1_DAC3_SEL_SHIFT)

/*
 * PWM1_DAC2_SEL (RW)
 *
 */
#define TRGM_DAC_MATRIX_SEL2_PWM1_DAC2_SEL_MASK (0xFFU)
#define TRGM_DAC_MATRIX_SEL2_PWM1_DAC2_SEL_SHIFT (0U)
#define TRGM_DAC_MATRIX_SEL2_PWM1_DAC2_SEL_SET(x) (((uint32_t)(x) << TRGM_DAC_MATRIX_SEL2_PWM1_DAC2_SEL_SHIFT) & TRGM_DAC_MATRIX_SEL2_PWM1_DAC2_SEL_MASK)
#define TRGM_DAC_MATRIX_SEL2_PWM1_DAC2_SEL_GET(x) (((uint32_t)(x) & TRGM_DAC_MATRIX_SEL2_PWM1_DAC2_SEL_MASK) >> TRGM_DAC_MATRIX_SEL2_PWM1_DAC2_SEL_SHIFT)

/* Bitfield definition for register: POS_MATRIX_SEL0 */
/*
 * QEO1_POSIN_SEL (RW)
 *
 */
#define TRGM_POS_MATRIX_SEL0_QEO1_POSIN_SEL_MASK (0xFF00U)
#define TRGM_POS_MATRIX_SEL0_QEO1_POSIN_SEL_SHIFT (8U)
#define TRGM_POS_MATRIX_SEL0_QEO1_POSIN_SEL_SET(x) (((uint32_t)(x) << TRGM_POS_MATRIX_SEL0_QEO1_POSIN_SEL_SHIFT) & TRGM_POS_MATRIX_SEL0_QEO1_POSIN_SEL_MASK)
#define TRGM_POS_MATRIX_SEL0_QEO1_POSIN_SEL_GET(x) (((uint32_t)(x) & TRGM_POS_MATRIX_SEL0_QEO1_POSIN_SEL_MASK) >> TRGM_POS_MATRIX_SEL0_QEO1_POSIN_SEL_SHIFT)

